oname = input("Название заказа: ")
cname = input("Имя заказчика: ")
item1 = input("Название первой позиции: ")
item1k = int(input("Количество первой позиции: "))
item1p = float(input("Цена первой позиции: "))
item2 = input("Название второй позиции: ")
item2k = int(input("Количество второй позиции: "))
item2p = float(input("Цена второй позиции: "))
delivery = float(input("Стоимость доставки: "))
paid = float(input("Внесённая сумма: "))
item1_total = item1k * item1p
item2_total = item2k * item2p
goods_total = item1_total + item2_total
total = goods_total + delivery
total_units = item1k + item2k
change = paid - total
print()
print("Заказ:", oname)
print("Заказчик:", cname)
print(f"Название:{item1} , Количество:{item1k} , Цена:{item1p:.2f} , Стоимость:{item1_total:.2f}")
print(f"Название:{item2} , Количество:{item2k} , Цена:{item2p:.2f} , Стоимость:{item2_total:.2f}")
print(f"Стоимость товаров без доставки: {goods_total:.2f}")
print(f"Стоимость доставки: {delivery:.2f}")
print(f"Общая сумма с доставкой: {total:.2f}")
print(f"Общее количество единиц: {total_units}")
print(f"Сдача: {change:.2f}")

# Канцелярия
# Ввод:
# Название заказа: Канцелярия
# Имя заказчика: Колодин Максим
# Название первой позиции: Тетради
# Количество первой позиции: 10
# Цена первой позиции: 45.50
# Название второй позиции: Ручки
# Количество второй позиции: 5
# Цена второй позиции: 30.00
# Стоимость доставки: 200.00
# Внесённая сумма: 1000.00
# Тетради: 10 * 45.50 = 455.00
# Ручки: 5 * 30.00 = 150.00
# Стоимость товаров без доставки: 455.00 + 150.00 = 605.00
# Общая сумма с доставкой: 605.00 + 200.00 = 805.00
# Общее количество единиц: 10 + 5 = 15
# Сдача: 1000.00 - 805.00 = 195.00
# Вывод:
# Заказ: Канцелярия
# Заказчик: Иван Петров
# Название:Тетради  Количество:10 , Цена:45.50 ,Стоимость:455.00
# Название:Ручки  Количество:5 , Цена:30.00 ,Стоимость:150.00
# Стоимость товаров без доставки: 605.00
# Стоимость доставки: 200.00
# Общая сумма с доставкой: 805.00
# Общее количество единиц: 15
# Сдача: 195.00